# 작업1유형

## Q1. Temperature컬럼에서 숫자가 아닌 문자들을 제거후 숫자 타입으로 바꾸고 3분위수에서 1분위수의 차이를 소숫점 이하 2자리까지 구하여라

In [152]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_1.csv')
df.head(5)

,Store,Date,Weekly_Sales,Holiday_Flag,Temperature,Fuel_Price,CPI,Unemployment
0,1,05-02-2010,1643690.90,0,42.31,2.572,211.096358,8.106
1,1,12-02-2010,1641957.44,1,38.51,2.548,211.242170,8.106
2,1,19-02-2010,1611968.17,0,39.93,2.514,211.289143,8.106
3,1,26-02-2010,1409727.59,0,46.63,2.561,211.319643,8.106
4,1,05-03-2010,1554806.68,0,46.5,2.625,211.350143,8.106

In [153]:
df['Temperature'].nunique()

3543

In [154]:
df['Temperature'] = df['Temperature'].str.replace(r'[^0-9.]','',regex="True").astype(float)
# 숫자와 소숫점이 아닌거
df['Temperature'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 6435 entries, 0 to 6434
Series name: Temperature
Non-Null Count  Dtype
--------------  -----
6435 non-null   float64
dtypes: float64(1)
memory usage: 50.4 KB

In [155]:
round(df['Temperature'].quantile(0.75) - df['Temperature'].quantile(0.25), 2)

27.48

## Q2. Likes를 Comments로 나눈 비율이 20이상이면서 Keyword값이 minecraft인 영상들의 Views값의 평균을 정수로 구하여라

In [156]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_2.csv')
df.head(2)

,Title,Video ID,Published At,Keyword,Likes,Comments,Views
0,Apple Pay Is Killing the Physical Wallet After...,wAZZ-UWGVHI,2022-08-23,tech,3407.0,672.0,135612.0
1,The most EXPENSIVE thing I own.,b3x28s61q3c,2022-08-24,tech,76779.0,4306.0,1758063.0

In [157]:
int(df[((df['Likes'] / df['Comments']) >= 20 ) & (df['Keyword'] == "minecraft")]['Views'].mean())

1789084

##  Q3. date_added가 2018년 1월 이면서 country가 United Kingdom 단독 제작인 데이터의 갯수

In [158]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p1_3.csv')
df.head(2)

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."

In [159]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [160]:
df['date_added'].value_counts()

date_added
January 1, 2020      109
November 1, 2019      89
March 1, 2018         75
December 31, 2019     74
October 1, 2018       71
                    ...
May 17, 2018           1
May 13, 2018           1
May 12, 2018           1
May 7, 2018            1
January 11, 2020       1
Name: count, Length: 1957, dtype: int64

In [161]:
df['date_time'] = pd.to_datetime(df['date_added'].str.strip(), format="%B %d, %Y")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
 12  date_time     8797 non-null   datetime64[ns]
dtypes: datetime64[ns](1), int64(1), object(11)
memory usage: 894.6+ KB

In [162]:
df['date_time'].dt.strftime("%Y-%m") == "2018-01"

0       False
1       False
2       False
3       False
4       False
        ...
8802    False
8803    False
8804    False
8805    False
8806    False
Name: date_time, Length: 8807, dtype: bool

In [163]:
df[( df['date_time'].dt.strftime("%Y-%m") == "2018-01" ) & (df['country']== "United Kingdom")].shape[0]

6

# 작업2유형

## Q1. 예측 변수 Segmentation, test.csv에 대해 ID별로 Segmentation의 클래스를 예측해서 저장후 제출, 제출 데이터 컬럼은 ID와 Segmentation 두개만 존재해야함. 평가지표는 macro f1 score

In [164]:
import pandas as pd
train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_train.csv')
test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p2_test.csv')

display(train.head(2))
test.head(2)

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,Segmentation
0,464357,Male,No,40,Yes,Artist,7.0,Low,1.0,Cat_6,A
1,459624,Male,No,18,No,Healthcare,NaN,Low,5.0,Cat_4,D

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,460406,Male,Yes,36,Yes,Healthcare,3.0,Low,2.0,Cat_6
1,466890,Male,Yes,47,Yes,Artist,0.0,Average,6.0,Cat_7

In [165]:
train['Segmentation'].value_counts()

Segmentation
D    1388
A    1244
C    1143
B    1106
Name: count, dtype: int64

In [166]:
train.shape, test.shape

((4881, 11), (1542, 10))

In [167]:
train.isna().sum().sum(), test.isna().sum().sum()

(966, 283)

In [168]:
train.isna().sum()/len(train)

ID                 0.000000
Gender             0.000000
Ever_Married       0.019668
Age                0.000000
Graduated          0.010449
Profession         0.013112
Work_Experience    0.105101
Spending_Score     0.000000
Family_Size        0.039336
Var_1              0.010244
Segmentation       0.000000
dtype: float64

In [169]:
test.isna().sum()/len(test)

ID                 0.000000
Gender             0.000000
Ever_Married       0.014267
Age                0.000000
Graduated          0.010376
Profession         0.014916
Work_Experience    0.092088
Spending_Score     0.000000
Family_Size        0.044099
Var_1              0.007782
dtype: float64

In [170]:
pd.DataFrame({
    "dtypes": train.dtypes,
    "nan_ratio_train": train.isna().sum()/len(train),
    "nan_ratio_test": test.isna().sum()/len(test)
})

                  dtypes  nan_ratio_train  nan_ratio_test
Age                int64         0.000000        0.000000
Ever_Married      object         0.019668        0.014267
Family_Size      float64         0.039336        0.044099
Gender            object         0.000000        0.000000
Graduated         object         0.010449        0.010376
ID                 int64         0.000000        0.000000
Profession        object         0.013112        0.014916
Segmentation      object         0.000000             NaN
Spending_Score    object         0.000000        0.000000
Var_1             object         0.010244        0.007782
Work_Experience  float64         0.105101        0.092088

In [171]:
# 숫자형 데이터 결측치 채우기
# 이상치 확인
train.describe()

                  ID          Age  Work_Experience  Family_Size
count    4881.000000  4881.000000      4368.000000  4689.000000
mean   463476.022741    43.567916         2.685211     2.838132
std      2586.931166    16.687728         3.452785     1.538897
min    458982.000000    18.000000         0.000000     1.000000
25%    461236.000000    31.000000         0.000000     2.000000
50%    463447.000000    41.000000         1.000000     3.000000
75%    465717.000000    53.000000         5.000000     4.000000
max    467972.000000    89.000000        14.000000     9.000000

In [172]:
# 결측치 채우기
train_col = train.select_dtypes(include='number').columns
for col in train_col:
    train[col] = train[col].fillna(train[col].mean())

In [173]:
train[train_col].isna().sum()

ID                 0
Age                0
Work_Experience    0
Family_Size        0
dtype: int64

In [174]:
test.describe()

                  ID          Age  Work_Experience  Family_Size
count    1542.000000  1542.000000      1400.000000  1474.000000
mean   463551.448768    43.285344         2.452857     2.904342
std      2610.236569    16.726421         3.195432     1.567125
min    458984.000000    18.000000         0.000000     1.000000
25%    461249.250000    30.000000         0.000000     2.000000
50%    463681.000000    40.000000         1.000000     3.000000
75%    465803.000000    53.000000         4.000000     4.000000
max    467966.000000    89.000000        14.000000     9.000000

In [175]:
test_col = test.select_dtypes(include="number").columns
for col in test_col:
    test[col] = test[col].fillna(test[col].mean())

In [176]:
test[test_col].isna().sum()

ID                 0
Age                0
Work_Experience    0
Family_Size        0
dtype: int64

In [177]:
df = pd.concat([train, test], axis=0)
df.isna().sum()

ID                    0
Gender                0
Ever_Married        118
Age                   0
Graduated            67
Profession           87
Work_Experience       0
Spending_Score        0
Family_Size           0
Var_1                62
Segmentation       1542
dtype: int64

In [178]:
df_obejct = df.select_dtypes(include="object").columns[:-1]
for col in df_obejct:
    df[col] = df[col].fillna("unknown")

In [179]:
from sklearn.preprocessing import LabelEncoder
encoded_col = df.select_dtypes(include="object").columns[:-1]
encoders = {}
for col in encoded_col:
    encoder = LabelEncoder()
    df[col] = encoder.fit_transform(df[col])
    encoders[col] = encoder

df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6423 entries, 0 to 1541
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               6423 non-null   int64
 1   Gender           6423 non-null   int32
 2   Ever_Married     6423 non-null   int32
 3   Age              6423 non-null   int64
 4   Graduated        6423 non-null   int32
 5   Profession       6423 non-null   int32
 6   Work_Experience  6423 non-null   float64
 7   Spending_Score   6423 non-null   int32
 8   Family_Size      6423 non-null   float64
 9   Var_1            6423 non-null   int32
 10  Segmentation     4881 non-null   object
dtypes: float64(2), int32(6), int64(2), object(1)
memory usage: 451.6+ KB

In [180]:
n_train = len(train)
train_df = df.iloc[:n_train]
test_df = df.iloc[n_train:]

encoder = LabelEncoder()
train_df['Segmentation'] = encoder.fit_transform(train_df['Segmentation'] )
encoders['Segmentation'] = encoder

train_df['Segmentation']

C:\Users\yesol\AppData\Local\Temp\ipykernel_6208\3307526677.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train_df['Segmentation'] = encoder.fit_transform(train_df['Segmentation'] )

0       0
1       3
2       3
3       1
4       2
       ..
4876    2
4877    3
4878    3
4879    0
4880    0
Name: Segmentation, Length: 4881, dtype: int32

In [181]:
from sklearn.model_selection import train_test_split

X = train_df.drop(['ID', 'Segmentation'], axis=1)
y_encoded = train_df['Segmentation']
X_train, X_valid, y_train, y_valid = train_test_split(X, y_encoded, test_size=0.2, random_state=42)

In [183]:
test_df.isna().sum()

ID                    0
Gender                0
Ever_Married          0
Age                   0
Graduated             0
Profession            0
Work_Experience       0
Spending_Score        0
Family_Size           0
Var_1                 0
Segmentation       1542
dtype: int64

In [184]:
X_test = test_df.drop(['ID','Segmentation'], axis=1)

In [185]:
from sklearn.ensemble import RandomForestClassifier

model_rf = RandomForestClassifier(random_state=42)
model_rf.fit(X_train, y_train)
y_pred_rf = model_rf.predict(X_valid)
y_pred_rf

array([3, 3, 1, 0, 1, 1, 0, 3, 0, 2, 1, 0, 3, 2, 2, 1, 1, 0, 1, 3, 1, 3,
       2, 3, 2, 3, 3, 2, 1, 3, 0, 3, 0, 1, 0, 2, 1, 1, 0, 0, 0, 3, 0, 1,
       2, 3, 1, 2, 3, 1, 2, 3, 2, 1, 0, 0, 0, 2, 2, 3, 1, 3, 2, 3, 0, 0,
       3, 0, 2, 3, 1, 3, 3, 0, 1, 3, 0, 2, 0, 0, 1, 3, 0, 1, 1, 2, 3, 2,
       1, 1, 3, 1, 3, 0, 1, 0, 3, 2, 1, 2, 0, 3, 1, 3, 3, 3, 3, 0, 3, 1,
       2, 1, 0, 2, 1, 3, 0, 0, 2, 3, 2, 3, 3, 0, 0, 0, 1, 2, 0, 2, 2, 1,
       1, 3, 2, 3, 0, 3, 0, 0, 3, 3, 3, 1, 3, 3, 3, 3, 3, 3, 3, 0, 1, 2,
       0, 0, 1, 0, 1, 3, 2, 2, 3, 2, 2, 2, 2, 0, 2, 1, 2, 0, 1, 0, 1, 1,
       2, 2, 1, 3, 1, 0, 0, 2, 3, 0, 0, 0, 3, 3, 0, 1, 3, 3, 0, 2, 2, 3,
       1, 3, 3, 0, 1, 3, 3, 3, 2, 3, 0, 3, 0, 1, 2, 1, 1, 0, 0, 3, 2, 1,
       0, 3, 2, 0, 0, 3, 2, 0, 2, 0, 3, 0, 2, 3, 2, 0, 3, 1, 0, 2, 1, 0,
       3, 3, 2, 2, 2, 0, 3, 2, 3, 1, 3, 1, 2, 3, 3, 0, 1, 2, 2, 3, 2, 3,
       3, 3, 0, 0, 3, 3, 1, 2, 2, 3, 0, 3, 0, 3, 2, 2, 0, 0, 3, 3, 2, 2,
       0, 3, 2, 1, 3, 2, 0, 3, 0, 1, 0, 2, 0, 3, 1, 1, 0, 0, 3, 0, 3, 1,
       3, 0, 2, 3, 2, 2, 0, 3, 3, 3, 3, 0, 0, 2, 0, 1, 0, 0, 3, 1, 2, 0,
       1, 2, 0, 3, 3, 2, 3, 2, 1, 3, 3, 3, 3, 0, 3, 0, 3, 3, 1, 2, 3, 0,
       0, 2, 1, 3, 1, 1, 1, 1, 1, 3, 0, 3, 1, 0, 3, 0, 3, 2, 3, 3, 3, 0,
       0, 1, 2, 2, 0, 3, 0, 0, 0, 0, 3, 0, 2, 1, 3, 3, 3, 1, 0, 2, 0, 3,
       3, 0, 2, 2, 3, 0, 0, 2, 2, 1, 2, 2, 1, 3, 1, 0, 3, 0, 2, 3, 3, 3,
       0, 2, 2, 3, 3, 1, 0, 2, 2, 3, 0, 1, 3, 2, 3, 3, 0, 3, 0, 0, 0, 1,
       0, 0, 0, 3, 1, 0, 3, 0, 1, 0, 0, 2, 1, 3, 0, 2, 3, 1, 2, 0, 3, 3,
       2, 2, 2, 2, 1, 2, 3, 2, 0, 2, 2, 3, 0, 2, 1, 0, 3, 2, 3, 2, 3, 0,
       1, 0, 1, 2, 1, 1, 1, 0, 3, 3, 1, 0, 0, 1, 0, 1, 0, 3, 2, 0, 2, 3,
       2, 3, 2, 2, 1, 1, 0, 0, 1, 2, 3, 2, 3, 2, 3, 0, 2, 0, 0, 3, 1, 1,
       1, 3, 2, 3, 2, 1, 1, 1, 3, 2, 0, 0, 1, 0, 1, 0, 0, 3, 1, 2, 3, 3,
       0, 3, 0, 2, 3, 0, 0, 2, 3, 0, 1, 2, 2, 3, 0, 2, 2, 1, 0, 3, 2, 2,
       3, 0, 1, 1, 3, 0, 1, 3, 3, 0, 3, 3, 1, 0, 0, 0, 2, 3, 0, 3, 1, 2,
       2, 3, 2, 0, 2, 1, 3, 0, 3, 2, 1, 2, 0, 0, 2, 0, 0, 3, 0, 2, 3, 0,
       1, 2, 1, 2, 1, 3, 1, 3, 2, 0, 0, 3, 1, 1, 2, 3, 2, 2, 3, 3, 2, 2,
       0, 0, 3, 0, 0, 0, 3, 0, 3, 0, 3, 1, 1, 3, 2, 1, 3, 0, 2, 0, 3, 0,
       0, 0, 1, 0, 2, 0, 3, 0, 0, 1, 0, 3, 1, 0, 1, 0, 0, 3, 1, 0, 0, 0,
       2, 1, 0, 1, 0, 2, 2, 3, 0, 1, 0, 3, 3, 3, 2, 1, 1, 1, 0, 3, 0, 1,
       2, 0, 2, 1, 3, 2, 3, 3, 0, 0, 3, 1, 1, 1, 2, 3, 3, 2, 3, 0, 3, 0,
       2, 2, 2, 3, 3, 1, 2, 2, 1, 3, 0, 0, 3, 3, 0, 3, 3, 1, 0, 2, 1, 3,
       3, 1, 3, 2, 3, 0, 3, 0, 0, 3, 3, 2, 1, 3, 0, 1, 2, 3, 3, 1, 0, 0,
       1, 3, 0, 0, 1, 2, 0, 1, 0, 1, 2, 3, 3, 1, 1, 1, 1, 0, 2, 2, 1, 2,
       3, 1, 3, 0, 0, 0, 3, 0, 3, 0, 3, 0, 2, 1, 0, 2, 2, 2, 1, 0, 1, 3,
       1, 1, 2, 2, 3, 3, 0, 3, 0, 0, 1, 3, 3, 0, 1, 3, 2, 3, 3, 1, 0, 0,
       0, 1, 3, 3, 1, 2, 1, 3, 3, 0, 3, 0, 1, 3, 3, 1, 0, 3, 3, 1, 1, 0,
       2, 3, 2, 2, 0, 1, 3, 2, 0, 1, 3, 2, 1, 3, 0, 0, 0, 1, 0, 3, 2, 2,
       1, 1, 0, 0, 0, 2, 1, 2, 0, 3, 0, 3, 0, 1, 3, 0, 1, 1, 0, 3, 3, 2,
       0, 3, 0, 3, 3, 0, 2, 3, 0, 2, 0, 2, 0, 0, 3, 1, 0, 3, 2, 3, 3, 2,
       2, 2, 0, 0, 3, 3, 1, 1, 2, 3, 0, 0, 3, 0, 0, 2, 2, 1, 2, 2, 0, 1,
       0, 3, 2, 1, 3, 0, 3, 2, 2, 2, 2, 3, 3, 3, 3, 1, 1, 0, 3, 1, 0, 0,
       0, 1, 3, 3, 0, 0, 1, 3, 1])

In [187]:
from sklearn.metrics import f1_score

score = f1_score(y_valid, y_pred_rf, average='macro')
score

0.4129366551174357

In [188]:
y_pred_encoded = model_rf.predict(X_test)
y_pred_encoded

array([3, 2, 1, ..., 3, 2, 1])

In [192]:
y_pred = encoders['Segmentation'].inverse_transform(y_pred_encoded)
y_pred

array(['D', 'C', 'B', ..., 'D', 'C', 'B'], dtype=object)

In [193]:
result = pd.DataFrame({
    "ID": test['ID'],
    "Segmentation": y_pred
})
result

          ID Segmentation
0     460406            D
1     466890            C
2     466145            B
3     465805            B
4     466137            C
...      ...          ...
1537  463734            A
1538  466055            C
1539  465689            D
1540  460401            C
1541  465215            B

[1542 rows x 2 columns]

In [194]:
result.to_csv('result4.csv', index=False)

test = pd.read_csv('result4.csv')
test

          ID Segmentation
0     460406            D
1     466890            C
2     466145            B
3     465805            B
4     466137            C
...      ...          ...
1537  463734            A
1538  466055            C
1539  465689            D
1540  460401            C
1541  465215            B

[1542 rows x 2 columns]

In [195]:
train['Ever_Married'].value_counts()

Ever_Married
Yes    2805
No     1980
Name: count, dtype: int64

# 작업 3유형

## Q4. 어느 대학교의 신입생의 학과별 성별에 대한 데이터이다.
이 데이터를 바탕으로, 학생들의 학과와 성별이 서로 독립적인지 여부를 확인하기 위해 카이제곱 독립성 검정을 실시 하려한다.
학과 평균 인원에 대한 값을 소숫점 이하 3자리까지 구하여라

In [196]:
import pandas as pd 
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e4_p3_1_.csv')
df.head()

         학번     학과 성별
0  DFSKJK_1   경영학과  여
1  DFSKJK_2   사회학과  여
2  DFSKJK_3  기계공학과  여
3  DFSKJK_4   경제학과  남
4  DFSKJK_5  기계공학과  여

In [197]:
df.shape

(1022, 3)

In [202]:
df['학과'].nunique()

6

In [205]:
round(len(df) / df['학과'].nunique(),3)

170.333

## Q5. 카이제곱검정 독립성 검정 통계량을 소숫점 이하 3자리까지 구하여라

In [213]:
observed = pd.crosstab(df['학과'],df['성별'])
observed

성별       남    여
학과
경영학과   150  171
경제학과    79   91
기계공학과  125  119
사회학과    48   51
의학과     32   27
전자공학과   74   55

In [218]:
from scipy.stats import chi2_contingency

stat, p, dof, exp = chi2_contingency(observed)
round(stat,3)

5.646

## Q6. 카이제곱검정 독립성 검정의 pvalue를 소숫점 이하 3자리까지 구하여라. 유의수준 0.05하에서 귀무가설과 대립가설중 유의한 것을 출력하라

In [ ]:
"귀무가설",round(p, 3) if round(p, 3) > 0.05 else "대립가설"
# 귀무가설: 두 범주형 변수는 서로 독립적이다.

('귀무가설', 0.342)

## Q7. 어느 학교에서 수학 시험을 본 학생 100명 중 60명이 60점 이상을 받았다. 이 학교의 수학 시험의 평균 점수가 50점 이상인지 95%의 신뢰 수준에서 검정하려한다.
검정 통계량을 소숫점 이하 3자리에서 구하시오

In [ ]:
# 귀무가설(H0): 학교의 수학 시험에서 60점 이상 받을 확률 p< 0.5 (평균점수가 50점 미만이다)
# 대립가설 : 학교의 수학시험에서 60점 이상을 받을 확률 p >= 0.5 (평균 점수가 50점 이상이다)
## 밝히고 싶은걸 대립가설로 둔다. 단측 검정은 대립가설의 방향에 따른다.

# 검정통계량 계산
p_hat = 60 / 100 # 표본의 비율
p_0 = 0.5 # 귀무가설에서 가정한 비율
n = 100 # 표본의 크기

import numpy as np
Z = round((p_hat - p_0) / np.sqrt(p_0 * (1-p_0) / n),3)
Z

2.0

## Q8. pvalue를 소숫점 이하 3자리까지 구하고 귀무가설과 대립가설중 유의한 것을 출력하라

In [ ]:
from scipy.stats import norm

z0_05 = 1-norm.ppf(0.05) # 누적 확률이 0.05가 되는 Z의 값, Z0.05

Z > z0_05 # 귀무가설을 기각. 학교의 평균 점수는 50점 이상일 가능성이 있다.

False

In [2]:
from scipy.stats import norm
p_value= round(1-norm.cdf(Z),3)
p_value

0.023

In [4]:
"귀무가설" if p_value > 0.05 else "대립가설"

'대립가설'